02_OpenFOAM_FVM/cases/Ejercicio4/Parte2_ShockTube/shockTube_lowOrder/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc mag(U)
#includeFunc graphCell
(
    name=graph,
    start=(-1e6 0 0),
    end=(1e6 0 0),
    axis=x,
    fields=(T mag(U) p)
)

// ************************************************************************* //
